/*
    จงเขียนโปรแกรมภาษาซีเพื่อรับข้อมูลจากผู้ใช้เป็นตัวเลข และให้แสดงชุดอนุกรมตามจำนวนตัวเลขที่กรอก พร้อมกับแสดงผลรวมของชุดอนุกรมนี้ 9 + 99 + 999 + 9999 + 9999 + .... เช่น ผู้ใช้กรอกเลข 5 ให้แสดงชุดอนุกรมคือ 9 + 99 + 999 + 9999 + 99999 และแสดงผลรวมคือ 111105
    (โจทย์ข้อนี้ให้ใช้ For Loop เท่านั้น)
    
    Test case:
        Enter number :
            5
    Output:
        Series = 9 + 99 + 999 + 9999 + 99999
        Sum = 111105

    Test case:
        Enter number :
            7
    Output:
        Series = 9 + 99 + 999 + 9999 + 99999 + 999999 + 9999999
        Sum = 11111103
*/
#include <stdio.h>
#include <math.h>


int main(){

    int n = 0 ;         //รับค่าจากผู้ใช้
    int i = 0 ;         //จะบวกจำนวนทีละ 1 จนกว่าจะครบตามที่กรอกใน n ( กรณีตัวเลข 9 )
    int j = 0 ;         //จะบวกจำนวนทีละ 1 จนกว่าจะครบตามที่กรอกใน n ( กรณี + )
    int sum = 0 ;       // sum จะรับค่ามาจาก result เช่นรอบแรกได้ 9 รอบสองได้ 99 โดย[ 9 x 10⁰ = 9 ][  9 x 10¹= 90+9 = 99  ]
    int result = 0 ;    //กำหนดให้ result เป็นเลขยกกำลัง โดย( 9 x 10ⁱ)
    int total = 0 ;     //จะรับค่ามาจากsum แล้ว + จำนวนทั้งหมดเพื่อแสดงผลลัพธ์
  

  

    printf("Enter number : ");
    scanf("%d", &n);

    printf("Series = ");

    for ( i = 0 ; i <= n-1 ; i++ ){
        
        result = 9 * pow(10,i);
        sum += result;
        total += sum;

        printf(" %d ", sum);

        for ( j = i ; j < n-1 ; j++ ){
            printf("+");
            break;
        }
        
    }
        printf("\nSum =%d\n",total);



    return 0;

}
